app/Controllers/Api/v1/Me/Index.php

    public function index()
    {
        $payload = $this->request->payload;
        $users= new Users();
        $me = $users
            ->select(["name", "username"])
            ->where("id",$payload["id"])
            ->first();
---
SELECT `name`, `username`
FROM `users`
WHERE `id` = '1'
AND `users`.`deleted_at` IS NULL
 LIMIT 1