app/Controllers/Api/v1/Auth/SignUp.php

SELECT *
FROM `users`
WHERE `username` = '123'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function index()
    {
        $this->users = new Users();

        $username = $this->request->getPost("username");
        $password = $this->request->getPost("password");
        $name = $this->request->getPost("name");

        $checkUser = $this->users->where('username', $username)->first();