app/Controllers/Api/v1/Auth/SignIn.php

    public function index()
    {

        $this->users = new Users();
        $username = $this->request->getPost("username");
        $password = $this->request->getPost("password");


        $checkUser = $this->users->where('username', $username)->where("password", md5($password))->first();
---
SELECT *
FROM `users`
WHERE `username` = '123'
AND `password` = '202cb962ac59075b964b07152d234b70'
AND `users`.`deleted_at` IS NULL
 LIMIT 1